TexasInstruments/mcupsdk-core/test/drivers/dac/am261x-som/r5fss0-0_nortos/example.syscfg
section3.load_memory             = "OCRAM";
section3.$name                   = "Code and Read-Only Data";
section3.output_section.create(2);
section3.output_section[0].$name = ".text";
section3.output_section[1].$name = ".rodata";

section4.load_memory             = "OCRAM";
section4.$name                   = "Data Segment";
section4.output_section.create(1);
section4.output_section[0].$name = ".data";

section5.load_memory                             = "OCRAM";
section5.$name                                   = "Memory Segments";
section5.output_section.create(3);
section5.output_section[0].$name                 = ".bss";
section5.output_section[0].output_sections_start = "__BSS_START";
section5.output_section[0].output_sections_end   = "__BSS_END";
section5.output_section[1].$name                 = ".sysmem";
section5.output_section[2].$name                 = ".stack";

section6.load_memory                              = "OCRAM";
section6.$name                                    = "Stack Segments";
section6.output_section.create(5);
section6.output_section[0].$name                  = ".irqstack";
section6.output_section[0].output_sections_start  = "__IRQ_STACK_START";
section6.output_section[0].output_sections_end    = "__IRQ_STACK_END";
section6.output_section[0].input_section.create(1);
section6.output_section[0].input_section[0].$name = ". = . + __IRQ_STACK_SIZE;";
section6.output_section[1].$name                  = ".fiqstack";
section6.output_section[1].output_sections_start  = "__FIQ_STACK_START";
section6.output_section[1].output_sections_end    = "__FIQ_STACK_END";
section6.output_section[1].input_section.create(1);
section6.output_section[1].input_section[0].$name = ". = . + __FIQ_STACK_SIZE;";
section6.output_section[2].$name                  = ".svcstack";
section6.output_section[2].output_sections_start  = "__SVC_STACK_START";
section6.output_section[2].output_sections_end    = "__SVC_STACK_END";
section6.output_section[2].input_section.create(1);
section6.output_section[2].input_section[0].$name = ". = . + __SVC_STACK_SIZE;";
section6.output_section[3].$name                  = ".abortstack";
section6.output_section[3].output_sections_start  = "__ABORT_STACK_START";
section6.output_section[3].output_sections_end    = "__ABORT_STACK_END";
section6.output_section[3].input_section.create(1);
section6.output_section[3].input_section[0].$name = ". = . + __ABORT_STACK_SIZE;";
section6.output_section[4].$name                  = ".undefinedstack";
section6.output_section[4].output_sections_start  = "__UNDEFINED_STACK_START";
section6.output_section[4].output_sections_end    = "__UNDEFINED_STACK_END";
section6.output_section[4].input_section.create(1);
section6.output_section[4].input_section[0].$name = ". = . + __UNDEFINED_STACK_SIZE;";

section7.load_memory             = "OCRAM";
section7.$name                   = "Initialization and Exception Handling";
section7.output_section.create(3);
section7.output_section[0].$name = ".ARM.exidx";
section7.output_section[1].$name = ".init_array";
section7.output_section[2].$name = ".fini_array";

section8.load_memory             = "USER_SHM_MEM";
section8.type                    = "NOLOAD";
section8.$name                   = "User Shared Memory";
section8.group                   = false;
section8.output_section.create(1);
section8.output_section[0].$name = ".bss.user_shared_mem";

section9.load_memory             = "LOG_SHM_MEM";
section9.$name                   = "Log Shared Memory";
section9.group                   = false;
section9.output_section.create(1);
section9.output_section[0].$name = ".bss.log_shared_mem";

section10.load_memory             = "RTOS_NORTOS_IPC_SHM_MEM";
section10.type                    = "NOLOAD";
section10.$name                   = "IPC Shared Memory";
section10.group                   = false;
section10.output_section.create(1);
section10.output_section[0].$name = ".bss.ipc_vring_mem";

section11.load_memory             = "MAILBOX_HSM";
section11.type                    = "NOLOAD";
section11.$name                   = "SIPC HSM Queue Memory";
section11.group                   = false;
section11.output_section.create(1);
section11.output_section[0].$name = ".bss.sipc_hsm_queue_mem";

section12.load_memory             = "MAILBOX_R5F";
section12.$name                   = "SIPC R5F Queue Memory";
section12.group                   = false;
section12.output_section.create(1);
section12.output_section[0].$name = ".bss.sipc_secure_host_queue_mem";

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
epwm1.EPWM.A.$suggestSolution           = "GPIO43";
epwm1.EPWM.B.$suggestSolution           = "GPIO44";
epwm2.EPWM.A.$suggestSolution           = "GPIO45";
epwm2.EPWM.B.$suggestSolution           = "GPIO52";
epwm3.EPWM.$suggestSolution             = "EPWM28";
epwm3.EPWM.A.$suggestSolution           = "GPIO99";
epwm3.EPWM.B.$suggestSolution           = "GPIO100";
epwm4.EPWM.$suggestSolution             = "EPWM31";
epwm4.EPWM.A.$suggestSolution           = "GPIO105";
epwm4.EPWM.B.$suggestSolution           = "GPIO106";
epwm5.EPWM.$suggestSolution             = "EPWM30";
epwm5.EPWM.A.$suggestSolution           = "GPIO103";
epwm5.EPWM.B.$suggestSolution           = "GPIO104";
epwm6.EPWM.$suggestSolution             = "EPWM29";
epwm6.EPWM.A.$suggestSolution           = "GPIO101";
epwm6.EPWM.B.$suggestSolution           = "GPIO102";
epwm7.EPWM.$suggestSolution             = "EPWM27";
epwm7.EPWM.A.$suggestSolution           = "GPIO97";
epwm7.EPWM.B.$suggestSolution           = "GPIO98";
epwm8.EPWM.$suggestSolution             = "EPWM26";
epwm8.EPWM.A.$suggestSolution           = "GPIO95";
epwm8.EPWM.B.$suggestSolution           = "GPIO96";
epwm9.EPWM.$suggestSolution             = "EPWM25";
epwm9.EPWM.A.$suggestSolution           = "GPIO93";
epwm9.EPWM.B.$suggestSolution           = "GPIO94";
epwm10.EPWM.$suggestSolution            = "EPWM24";
epwm10.EPWM.A.$suggestSolution          = "GPIO91";
epwm10.EPWM.B.$suggestSolution          = "GPIO92";
epwm11.EPWM.$suggestSolution            = "EPWM23";
epwm11.EPWM.A.$suggestSolution          = "GPIO109";
epwm11.EPWM.B.$suggestSolution          = "GPIO90";
epwm12.EPWM.$suggestSolution            = "EPWM22";
epwm12.EPWM.A.$suggestSolution          = "GPIO87";
epwm12.EPWM.B.$suggestSolution          = "GPIO89";
epwm13.EPWM.$suggestSolution            = "EPWM21";
epwm13.EPWM.A.$suggestSolution          = "GPIO85";
epwm13.EPWM.B.$suggestSolution          = "GPIO86";
epwm14.EPWM.$suggestSolution            = "EPWM20";
epwm14.EPWM.A.$suggestSolution          = "GPIO83";
epwm14.EPWM.B.$suggestSolution          = "GPIO84";
epwm15.EPWM.$suggestSolution            = "EPWM19";
epwm15.EPWM.A.$suggestSolution          = "GPIO81";
epwm15.EPWM.B.$suggestSolution          = "GPIO82";
epwm16.EPWM.$suggestSolution            = "EPWM18";
epwm16.EPWM.A.$suggestSolution          = "GPIO79";
epwm16.EPWM.B.$suggestSolution          = "GPIO80";
epwm17.EPWM.$suggestSolution            = "EPWM17";
epwm17.EPWM.A.$suggestSolution          = "GPIO77";
epwm17.EPWM.B.$suggestSolution          = "GPIO78";
epwm18.EPWM.$suggestSolution            = "EPWM16";
epwm18.EPWM.A.$suggestSolution          = "GPIO115";
epwm18.EPWM.B.$suggestSolution          = "GPIO116";
epwm19.EPWM.$suggestSolution            = "EPWM15";
epwm19.EPWM.A.$suggestSolution          = "GPIO37";
epwm19.EPWM.B.$suggestSolution          = "GPIO36";
epwm20.EPWM.$suggestSolution            = "EPWM14";
epwm20.EPWM.A.$suggestSolution          = "GPIO29";
epwm20.EPWM.B.$suggestSolution          = "GPIO35";
epwm21.EPWM.$suggestSolution            = "EPWM13";
epwm21.EPWM.A.$suggestSolution          = "EPWM13_A";
epwm21.EPWM.B.$suggestSolution          = "EPWM13_B";
epwm22.EPWM.$suggestSolution            = "EPWM12";
epwm22.EPWM.A.$suggestSolution          = "EPWM12_A";
epwm22.EPWM.B.$suggestSolution          = "GPIO3";
epwm23.EPWM.$suggestSolution            = "EPWM11";
epwm23.EPWM.A.$suggestSolution          = "EPWM11_A";
epwm23.EPWM.B.$suggestSolution          = "EPWM11_B";
epwm24.EPWM.$suggestSolution            = "EPWM10";
epwm24.EPWM.A.$suggestSolution          = "EPWM12_B";
epwm24.EPWM.B.$suggestSolution          = "EPWM10_B";
epwm25.EPWM.$suggestSolution            = "EPWM9";
epwm25.EPWM.A.$suggestSolution          = "GPIO61";
epwm25.EPWM.B.$suggestSolution          = "GPIO62";
epwm26.EPWM.$suggestSolution            = "EPWM8";
epwm26.EPWM.A.$suggestSolution          = "GPIO59";
epwm26.EPWM.B.$suggestSolution          = "GPIO60";
epwm27.EPWM.$suggestSolution            = "EPWM7";
epwm27.EPWM.A.$suggestSolution          = "GPIO57";
epwm27.EPWM.B.$suggestSolution          = "EPWM10_A";
epwm28.EPWM.$suggestSolution            = "EPWM6";
epwm28.EPWM.A.$suggestSolution          = "GPIO55";
epwm28.EPWM.B.$suggestSolution          = "GPIO56";
epwm29.EPWM.$suggestSolution            = "EPWM5";
epwm29.EPWM.A.$suggestSolution          = "GPIO53";
epwm29.EPWM.B.$suggestSolution          = "GPIO54";
epwm30.EPWM.$suggestSolution            = "EPWM4";
epwm30.EPWM.A.$suggestSolution          = "GPIO51";
epwm30.EPWM.B.$suggestSolution          = "GPIO46";
epwm31.EPWM.$suggestSolution            = "EPWM3";
epwm31.EPWM.A.$suggestSolution          = "GPIO49";
epwm31.EPWM.B.$suggestSolution          = "GPIO50";
epwm32.EPWM.$suggestSolution            = "EPWM2";
epwm32.EPWM.A.$suggestSolution          = "GPIO47";
epwm32.EPWM.B.$suggestSolution          = "GPIO48";
debug_log.uartLog.UART.$suggestSolution = "UART0";
timer1.RTI.$suggestSolution             = "RTI1";
